chat_system_403724010_actor_description=Priest Darius
chat_system_403724010_snap_2_question=^?^Good day, my son! Welcome to our modest chapel, a priceless mine of information on every subject, by the grace of His Majesty.<br>My name is Darius. I've been the keeper of the Archives for thirty years.
chat_system_403724010_snap_2_answer_0=^?^What is here in these archives?
chat_system_403724010_snap_1_question=^?^Here is the chapel where we keep the papers which tell the biography of every royal subject, from birth to death.
chat_system_403724010_snap_1_answer_0=^?^What about my biography? Can I have a look?
chat_system_403724010_snap_3_question=^?^Hmm, of course, [player] is in our archives as well. Actually, it's against the rules - but I will make an exception, for it would be interesting to hear what you think about our records - if they're correct or not. Here, take it. Everything we know about you is written here!
chat_system_403724010_snap_3_answer_0=^?^(Read...)
chat_system_403724010_snap_4_question=^?^[class] [player], the Royal Treasure Searcher. Biography.<br><br>[player] was born to the family of a petty baron, the owner of a modest castle and a couple of villages. His mother was a common maidservant from a roadside tavern. The young baron fell in love with her and made her his wife.<br>The baron received many guests and his lands were famous for the great wild boar hunting. One day, an important guest from the capital, dwarves' ambassador, visited the castle and asked to organize a good hunt for him.<br>The baron's people did their best, and drove many animals before the hunting party. And everything would have been fine, but a little dragon got mixed up in the ruckus. And a foolish stupid dwarf, ignoring the baron's advice, killed him.<br>That night, the furious mother of the little dragon burnt the castle to ashes...
chat_system_403724010_snap_4_answer_0=^?^(Read further...)
chat_system_403724010_snap_7_question=^?^In the morning, a knight-errant Michael Linderbros, nicknamed the Silver Flute, came to search the castle's ruins. He was looking for the dragon, but he came too late to help the castle's inhabitants. Among the smoking ruins, he found an injured boy, the only one to survive the attack of the dragon. The knight tracked down and killed the pangolin and took the boy with him.<br>Young [player] had been traveling with his savior for several years, as an armor-bearer. In the evenings, by the fire, the boy would listen to the old knight playing the flute and telling stories about knights and dragons, kings and assassins, old battles and amazing lands!
chat_system_403724010_snap_7_answer_0=^?^(Read further...)
chat_system_403724010_snap_8_question=^?^As the boy grew, the knight started to teach him. Every halt turned into an opportunity for practicing battle skills, or the lessons of etiquette and tactics, heraldry, and the language of different countries. When the boy was fourteen, the old knight took him to the capital, to the Knight's Temple.<br><br>The training in the Temple was not in vain. The boy became a true Knight, and thanks to a variety of talents, [player] was recommended to occupy the post of the Royal Treasure Searcher. At present he still occupies this position and serves his king faithfully.
chat_system_403724010_snap_8_answer_0=^?^(Finish reading...)
chat_system_403724010_snap_9_question=^?^So, what will you say? Are our records correct?
chat_system_403724010_snap_9_answer_0=^?^Well, I don't know what to say. Either somebody has a rich imagination, or that is a different [player]. Anyway, it wasn't like that at all.
chat_system_403724010_snap_9_answer_1=^?^Incredible! It's like I'm back in my past! Everything was just like that.
chat_system_403724010_snap_9_answer_2=^?^Yes, everything is correct. Thank you for allowing me to have a look at these papers.
chat_system_403724010_snap_5_question=^?^[class] [player], the royal Treasure Searcher. Biography.<br><br>[player] was born to a common tanner's family, and his mother maintained the garden of the local count. [player] was the eldest child in the family. He helped his father in the workshop and looked after younger children. His Uncle Vernon, a swindler who liked selling stolen goods, lived together with them. And one day, a cursed ring of the days of the Old Empire fell into Vernon's hands. That very night, he turned into a werewolf. He attacked his brother and fatally wounded him. He disappeared with sunrise, and in the evening returned with a horde of werewolves.<br>The village was besieged. Werewolves wandered around killing everyone they could find. Every day, several people died. In a week, the count's mercenaries came to take the injured and the children out of the village. Many others decided to leave the village under the protection of swords and spears of the warriors, who had been sent by the count; [player] with his family was among them. Werewolves allowed the carts to exit the village gate, and then attacked them. The combat was quick; the beasts easily killed the mercenaries, and then set upon the frightened women and children.
chat_system_403724010_snap_5_answer_0=^?^(Read further...)
chat_system_403724010_snap_13_question=^?^The boy hid in a cart, but the beasts smelled him out. One of the werewolves had already pulled the boy from the cart, and its jaws opened wide as it went for the kill...<br>But at that very moment, among the wolves and torn bodies appeared warriors in shining armor and white cloaks. They were paladins. Their silver swords and sparkling lightnings were devastating, and not a single werewolf escaped punishment. After the combat, the paladins healed all the the injured who were still alive. But their spells were helpless against death. That day, the boy became an orphan.<br>Two days later, the paladins had left. They took with them the young [player] and several other children who had lost their parents.
chat_system_403724010_snap_13_answer_0=^?^(Read further...)
chat_system_403724010_snap_14_question=^?^That is how [player] became a paladin learner. For several years he was taught theology and literature, writing and temple oration, he studied curses and blessings, herbs and potions recipes. And he was taught the art of combat. The boy studied the weak and strong sides of the undead creatures, he learned to kill zombies, skeletons and scavengers, ghosts and werewolves.<br>When the boy was sixteen years old, the temple prior sent him to the Darion Magic School. Though exhausting, the temple training was not in vain, and soon the youth become one of the best students at the School.<br>Having finished his education, based on his achievements and a rare gift which allowed him to find hidden treasures, [player] was recommended to occupy the post of royal Treasure Searcher. At present he still occupies this position, serving his king faithfully.
chat_system_403724010_snap_14_answer_0=^?^(Finish reading...)
chat_system_403724010_snap_6_question=^?^[class] [player], the royal Treasure Searcher. Biography.<br><br>His father was a seaside pickpocket, a great lover of wine and gambling. His mother died from fever a year after her son's birth. A major part of his childhood, [player] spent in the orphanage.<br>His talent for magic showed itself very early. Having been frightened by a big dog, the boy had cast a spell by accident and made the animal hang in midair. His father quickly realized how that talent could be turned into money, so he took his son to the local sorcerer by the name Orlano and sold him into the disciple, though the money was drunk away immediately.
chat_system_403724010_snap_6_answer_0=^?^(Read further...)
chat_system_403724010_snap_15_question=^?^The sorcerer turned out to be a spiteful old man, but he knew his work well, and soon the boy had succeeded in magic. His life was quiet and measured. Realizing that the boy is very gifted, the sorcerer began extend his business...<br>Usually the sorcerer was occupied with searching out lost things, or rainmaking during a drought. But once, trying to earn money, he agreed to end a pregnancy which was inconvenient for a certain customer noble in rank but licentious in spirit. The laws of the Magic Guild prohibit the use of magic in such matters, but for gold the sorcerer agreed to take the risk.<br>The poor girl's parents understood what had happened, and sent a delegation to the Magic Guild. Soon the sorcerer was discovered, and Guild's envoy came to his house...
chat_system_403724010_snap_15_answer_0=^?^(Read further...)
chat_system_403724010_snap_16_question=^?^This envoy was a knight, trained and armed to hunt mages. Upon sight of this visitor, the sorcerer became frightened, hid himself behind the boy and began to cast a spell. But the boy kept his head, and bit the mage's hand. The spell went wrong and the knight jumped up to him and stunned the mage with a well-placed blow. Having delivered the mage to the guards, the knight asked the boy where his parents were. When the boy said that his mother had died long ago and that his father was a gambler and drunkard, the knight brought him to the orphanage at the Knight's Temple. There the boy grew up, was accepted as a student, and in the end became the best mage in his class.<br>Having finished his education, due to his various achievements and a rare gift which allowed him to find hidden treasures, [player] was recommended to the post of Royal Treasure Searcher. At present he still occupies this position, serving his king faithfully.
chat_system_403724010_snap_16_answer_0=^?^(Finish reading...)
chat_system_403724010_snap_0_question=^?^I'm happy to see you, [player]. What brings you to my chapel?
chat_system_403724010_snap_0_answer_0=^?^I wanted to have a look at the records about me once again.
chat_system_403724010_snap_0_header_0=^?^Here they are. Take them. However, we haven't updated them for a long time. So some information may be out of date.
chat_system_403724010_snap_0_answer_1=^?^I just came to make sure that the precious archives are safe. I'll take my leave of you.
